{
    "header": {
        "about": "Sobre",
        "experience": "Experiência",
        "contact": "Contacto",
        "abbrHome":"Página Inicial",
        "abbrLan":"Mudar Linguagem",
        "abbrTheme":"Mudar Tema"
    },
    "footer": {
        "info1": "Desenhado no Figma e desenvolvido em Visual Studio Code.",
        "info2": "Construído com React e CSS.",
        "terms": "Termos e Condições"
    },
    "home": {
        "hello": "Olá, eu sou o Diogo",
        "paragraph": "O meu nome é Diogo Matos, sou licenciado em Engenharia Informática. Aqui poderá saber mais sobre mim, como a minha trajetória académica e profissional. Explore os meus projetos para ver no que trabalhei, descobrir as minhas competências digitais e descobrir a minha experiência. Sinta-se à vontade para entrar em contacto se tiver alguma dúvida ou quiser ligar-se."
    },
    "about": {
        "about": "Sobre",
        "paragraph": "O meu nome é Diogo Matos. Tenho 22 anos, sou português e licenciei-me recentemente em Engenharia Informática em Évora, Portugal. Através do meu curso e estágios, desenvolvi competências de programação significativas. Sou altamente proativo e estou sempre disposto a aprender e a trabalhar. Atualmente, estou focado em refinar as minhas competências de desenvolvimento web e mobile, particularmente com a framework React, e procuro ativamente oportunidades de emprego nestas áreas.",
        "projects": "Projetos",
        "click": "Clique aqui para ver mais ↗",
        "skills": "Competências Digitais"
    },
    "projects": [
        {
            "name": "Projetos de Tecnologias Web",
            "description": "Um projeto focado principalmente no desenvolvimento front-end, enquanto outro foi um projeto de desenvolvimento full-stack.",
            "technologies": [
                "HTML",
                "CSS",
                "JavaScript",
                "Java",
                "JSP",
                "SpringBoot",
                "Rest",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/TW"
        },
        {
            "name": "Projetos de Sistemas Distribuídos",
            "description": "No primeiro projeto, implementei a execução remota de métodos dentro da mesma rede. O segundo projeto envolveu o desenvolvimento de uma API REST para gerir a comunicação client-server e o acesso aos dados.",
            "technologies": [
                "Java",
                "Java RMI",
                "REST",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/SDist"
        },
        {
            "name": "Projeto em OutSystems",
            "description": "Este projeto foi concluído durante um estágio extracurricular na KPMG Portugal. Desenvolvi uma Reactive App para gerir projetos, seus managers e recursos.",
            "technologies": [
                "OutSystems"
            ],
            "link": null
        }
    ],
    "dataSkills":[
        {
            "name":"HTML",
            "percentage":"90%"
        },
        {
            "name":"CSS",
            "percentage":"85%"
        },
        {
            "name":"JavaScript",
            "percentage":"85%"
        },
        {
            "name":"React.JS",
            "percentage":"70%"
        },
        {
            "name":"Java",
            "percentage":"80%"
        },
        {
            "name":"OutSystems",
            "percentage":"75%"
        },
        {
            "name":"Python",
            "percentage":"60%"
        },
        {
            "name":"C",
            "percentage":"65%"
        }
    ],
    "projectsAbbr":{
        "abbrProject":"Repositório do Projeto",
        "abbrMore": "Os meus Repositórios"
    },
    "experience": {
        "title": "Experiência",
        "timeline1": {
            "title": "Licenciatura Engenharia Mecatrónica, Universidade de Évora",
            "date": "2021",
            "description": "Iniciei o curso, mas durante o primeiro ano percebi que a minha verdadeira paixão era a programação."
        },
        "timeline2": {
            "title": "Licenciatura Engenharia Informática, Universidade de Évora",
            "date": "2022",
            "description": "Ingressei neste curso após o único ano do anterior, aproveitando as equivalências e focando-me finalmente em algo de que gosto. "
        },
        "timeline3": {
            "title": "Estágio Extracurricular, KPMG Portugal",
            "date": "2023",
            "description": "Realizei um estágio com duração de 1 ano onde realizei um projeto em OutSystems, mais precisamente uma Reactive App."
        },
        "timeline4": {
            "title": "Estágio Curricular, KMPG Portugal",
            "date": "2024",
            "description": "Passado uns meses voltei a realizar mais um estágio na empresa mas desta vez com duração de 5 meses, onde tive o objetivo de analisar e testar soluções no mercado para o papel de Analytics para Reactive Apps em OutSystems, onde pela primeira vez tive contacto com o mundo de Web Analytics."
        },
        "timeline5": {
            "title": "Conclusão da Licenciatura em Engenharia Informática",
            "date": "2021",
            "description": "Passado dois anos conclui a licenciatura."
        }
    },
    "contact": {
        "title": "Sinta-se à vontade para entrar em contacto comigo através de qualquer um dos seguintes meios.",
        "fname": "Nome",
        "femail": "Email",
        "fsubject": "Assunto",
        "fmessage": "A sua mensagem",
        "fsubmit": "Enviar",
        "terms_part1": "Concordo com os",
        "terms_link": "Termos e Condições",
        "terms_part3": "e reconheço a",
        "privacy_policy_link": "Política de Privacidade",
        "required": "Obrigatório",
        "invalid": "Inválido"     
    },
    "cookies": {
        "description": "Este site utiliza cookies para melhorar a sua experiência de utilizador. Ao usar o meu site, concorda com a utilização de cookies.",
        "learn": "Saber Mais",
        "accept": "Aceitar",
        "reject":"Rejeitar"
    },
    "policy": {
        "title": "Termos e Condições",
        "privacyPolicy": "Política de Privacidade",
        "privacyPolicyP1":"A presente Política de Privacidade estabelece os termos e condições ao abrigo dos quais o website diogomatos.pt procede à gestão dos dados pessoais dos seus visitantes e utilizadores. A partir de 25 de maio de 2018, o Regulamento Geral sobre a Proteção de Dados (RGPD) – Regulamento n.º 2016/679 do Parlamento Europeu e do Conselho, de 27 de abril de 2016 – estabelece as regras relativas à proteção, tratamento e livre circulação dos dados pessoais das pessoas singulares. Este regulamento aplica-se diretamente a todas as entidades que procedam ao tratamento desses dados em qualquer Estado-membro da União Europeia, incluindo Portugal.",
        "privacyPolicyP2":"O objetivo desta comunicação é proporcionar-lhe um conhecimento claro das regras aplicáveis ao tratamento dos seus dados pessoais, dos direitos que lhe assistem, bem como informá-lo sobre como poderá gerir, de forma direta e simples, os respetivos consentimentos. No âmbito dos serviços prestados por este site, Diogo Matos, enquanto entidade que determina os meios de tratamento e as finalidades, é responsável pelo tratamento dos seus dados pessoais e por assegurar a proteção da sua privacidade, atuando em conformidade com a lei e com o RGPD.",
        "privacyPolicyP3":"Contacto: Email: diogo.matos.dev@outlook.com; Website: https://www.diogomatos.pt.",
        "whyWeCollect": "Razão pela Qual Recolhemos os seus Dados Pessoais",
        "whyWeCollectP1":"O website diogomatos.pt recolhe dados pessoais com a finalidade de comunicar consigo relativamente a possíveis colaborações, fornecer-lhe atualizações sobre novos projetos, e cumprir quaisquer obrigações legais. Os dados recolhidos são tratados com o compromisso de privacidade e segurança. Os seus dados são obtidos através de informações fornecidas direta ou indiretamente por si, através de formulários, e-mails, ou interações no website.",
        "whyWeCollectP2":"O Senhor/a Senhora tem, a qualquer momento, o direito de aceder aos seus dados pessoais, bem como de os modificar, limitar, ou apagar dentro dos limites do RGPD. Poderá retirar o seu consentimento ou exercer outros direitos previstos na lei, enviando um email para diogo.matos.dev@outlook.com.",
        "dataSharing": "Os seus Dados Pessoais serão Partilhados com Terceiros?",
        "dataSharingP1":"Para cumprir as finalidades expressas na presente Política de Privacidade, poderá ser necessário partilhar os seus dados pessoais com terceiros que nos prestam apoio nos serviços oferecidos, tais como fornecedores de alojamento ou ferramentas de desenvolvimento web.",
        "dataRetention": "Conservação dos Dados Pessoais",
        "dataRetentionP1":"O website diogomatos.pt conservará os seus dados pessoais pelo período necessário à prestação dos serviços e ao cumprimento das obrigações legais.",
        "consentWithdrawal": "Consequência da Retirada do Consentimento",
        "consentWithdrawalP1":"Caso o Senhor/a Senhora retire o seu consentimento, tal não compromete a licitude do tratamento efetuado até essa data. Os dados existentes serão destruídos.",
        "dataPortability": "Direito à Portabilidade",
        "dataPortabilityP1":"Caso tenha dado o seu consentimento ou estejamos a executar um contrato, o Senhor/a Senhora tem a possibilidade de solicitar o direito à portabilidade dos seus dados pessoais. Isto significa que terá o direito a receber os dados que nos forneceu num formato estruturado, de uso corrente e de leitura automática, e transmiti-los diretamente a outra entidade sem impedimentos da nossa parte.",
        "useOfData": "Utilização de Dados Pessoais",
        "useOfDataP1":"Quando nos disponibiliza informações, tais como o seu nome, endereço de e-mail, ou outros contactos, para efeitos de colaboração ou para discutir projetos, esses dados estarão sujeitos a esta Política de Privacidade, aos Termos de Utilização, e a outros documentos referidos (ver “Termos de Utilização”), aplicáveis a qualquer momento e que deverão ser revistos para garantir que são aceites.",
        "changesPolicy": "Alterações à Política de Privacidade",
        "changesPolicyP1":"O website diogomatos.pt reserva-se o direito de, a qualquer momento e sem aviso prévio, proceder às alterações que considere necessárias à sua Política de Privacidade. Em tais casos, será notificado das alterações que possam afetar a sua privacidade.",
        "cookieInformation": "Informação sobre Cookies",
        "cookieInformationP1":"O website diogomatos.pt utiliza cookies, próprios e de terceiros, e dispositivos similares para melhorar a experiência de navegação dos utilizadores, compreender como interagem com o site e, em determinados casos, para apresentar publicidade relevante, baseada nos hábitos de navegação.",
        "whatAreCookies": "O que são Cookies?",
        "whatAreCookiesP1":"Os cookies são pequenos ficheiros de texto armazenados no dispositivo do utilizador através do navegador de internet (browser). Estes ficheiros contêm apenas informação relacionada com as preferências do utilizador, não incluindo, assim, dados pessoais.",
        "whatAreCookiesP2":"Os cookies utilizados por diogomatos.pt observam os princípios da anonimidade e confidencialidade, sendo utilizados unicamente para reconhecer o utilizador em visitas futuras ao site. Não são utilizados para recolher informações que identifiquem pessoalmente o utilizador nem para finalidades de marketing direto.",
        "cookiesUse": "Para que servem os Cookies?",
        "cookiesUseP1":"Os cookies ajudam a melhorar a usabilidade do website, permitindo uma navegação mais rápida e eficiente, e eliminando a necessidade de introduzir repetidamente as mesmas informações. Servem também para analisar padrões de navegação e otimizar a estrutura do site.",
        "cookiesTypes": "Que tipo de Cookies são utilizados no nosso website?",
        "cookiesTypesP1":"Os cookies utilizados no diogomatos.pt têm diferentes funções e classificam-se nos seguintes tipos:",
        "cookiesTypesP2":"Cookies estritamente necessários (essenciais): Permitem a navegação no website e a utilização das suas funcionalidades, como o acesso a áreas seguras do site. Sem estes cookies, os serviços solicitados não podem ser prestados.",
        "cookiesTypesP3":"Cookies analíticos: Utilizados para coletar informações sobre como os visitantes utilizam o site, como as páginas mais visitadas ou se encontram mensagens de erro em determinadas páginas. Estes cookies são usados para fins estatísticos e de melhoria contínua do website.",
        "cookiesTypesP4":"Cookies de funcionalidade: Guardam as preferências do utilizador relativamente à utilização do site, como o idioma ou a região preferida, de modo a oferecer uma experiência mais personalizada.",
        "manageCookies": "Como gerir os Cookies?",
        "manageCookiesP1":"O Senhor/a Senhora pode, a qualquer momento, configurar as definições do seu navegador de internet para ser notificado sobre a receção de cookies e decidir se pretende aceitá-los, recusá-los ou apagá-los. É importante notar que, ao recusar a utilização de cookies, algumas funcionalidades do website poderão não estar disponíveis ou a navegação pode não ser otimizada.",
        "termsOfUse": "Termos de Utilização",
        "termsOfUseP1":"A informação disponibilizada no diogomatos.pt pode ser visualizada, copiada, impressa e distribuída exclusivamente para uso não comercial, desde que todas as cópias incluam o aviso legal de copyright abaixo indicado. Esta informação pode também ser utilizada para efetuar pedidos de colaboração ou informações sobre projetos. O conteúdo deste site não poderá ser modificado ou reinterpretado de forma a ficar protegido sob outro copyright, patente, marca ou registo de propriedade intelectual que não pertença a Diogo Matos.",
        "termsOfUseP2":"A informação disponibilizada no diogomatos.pt pode conter alguma imprecisão técnica ou erro tipográfico. Consequentemente, Diogo Matos não assume qualquer responsabilidade por danos diretos, indiretos, incidentais ou colaterais resultantes da visita a estas páginas, nomeadamente perda de dados, perda de receitas ou outros proveitos, e interrupção de processos de negócio derivados da utilização ou impossibilidade de utilização da informação presente neste site.",
        "termsOfUseP3":"Diogo Matos rejeita, ainda, quaisquer responsabilidades pelos conteúdos de sites de terceiros que contenham ligações para ou a partir de diogomatos.pt.",
        "copyright": "Copyright",
        "copyrightP1":"Todos os elementos contidos no website diogomatos.pt, nomeadamente textos, fotos, ilustrações e outros, estão protegidos pela lei, ao abrigo do Código dos Direitos de Autor e dos Direitos Conexos.",
        "copyrightP2":"É expressamente proibida a cópia, reprodução e divulgação dos textos, fotos, ilustrações e outros elementos contidos neste website sem autorização expressa de Diogo Matos, independentemente dos meios utilizados, com exceção do direito de citação definido na lei.",
        "copyrightP3":"É expressamente proibido o uso comercial dos elementos contidos no website diogomatos.pt, nomeadamente textos, fotos, ilustrações e outros.",
        "copyrightP4":"Diogo Matos reserva-se o direito de agir judicialmente contra os autores de qualquer cópia, reprodução, difusão ou exploração comercial não autorizadas dos elementos contidos neste website, nomeadamente textos, fotos, ilustrações e outros."
    }
}