{
    "header": {
        "about": "Sobre",
        "experience": "Experiência",
        "contact": "Contacto"
    },
    "footer": {
        "info": "Desenhado no Figma e desenvolvido em Visual Studio Code. Construído com React e CSS."
    },
    "home": {
        "hello": "Olá, eu sou o Diogo",
        "paragraph": "O meu nome é Diogo Matos, sou licenciado em Engenharia Informática. Aqui poderá saber mais sobre mim, como a minha trajetória académica e profissional. Explore os meus projetos para ver no que trabalhei, descobrir as minhas competências digitais e descobrir a minha experiência. Sinta-se à vontade para entrar em contacto se tiver alguma dúvida ou quiser ligar-se."
    },
    "about": {
        "about": "Sobre",
        "paragraph": "O meu nome é Diogo Matos. Tenho 21 anos, sou português e licenciei-me recentemente em Engenharia Informática em Évora, Portugal. Através do meu curso e estágios, desenvolvi competências de programação significativas. Sou altamente proativo e estou sempre disposto a aprender e a trabalhar. Atualmente, estou focado em refinar as minhas competências de desenvolvimento web e mobile, particularmente com a framework React, e procuro ativamente oportunidades de emprego nestas áreas.",
        "projects": "Projetos",
        "click": "Clique aqui para ver mais ↗",
        "skills": "Competências Digitais"
    },
    "projects": [
        {
            "name": "Projetos de Tecnologias Web",
            "description": "Um projeto focado principalmente no desenvolvimento front-end, enquanto outro foi um projeto de desenvolvimento full-stack.",
            "technologies": [
                "HTML",
                "CSS",
                "JavaScript",
                "Java",
                "JSP",
                "SpringBoot",
                "Rest",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/TW"
        },
        {
            "name": "Projetos de Sistemas Distribuídos",
            "description": "No primeiro projeto, implementei a execução remota de métodos dentro da mesma rede. O segundo projeto envolveu o desenvolvimento de uma API REST para gerir a comunicação client-server e o acesso aos dados.",
            "technologies": [
                "Java",
                "Java RMI",
                "REST",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/SDist"
        },
        {
            "name": "Projeto em OutSystems",
            "description": "Este projeto foi concluído durante um estágio extracurricular na KPMG Portugal. Desenvolvi uma Reactive App para gerir projetos, seus managers e recursos.",
            "technologies": [
                "OutSystems"
            ],
            "link": null
        }
    ],
    "experience": {
        "title": "Experiência",
        "timeline1": {
            "title": "Licenciatura Engenharia Mecatrónica, Universidade de Évora",
            "date": "2021",
            "description": "Iniciei o curso, mas durante o primeiro ano percebi que a minha verdadeira paixão era a programação."
        },
        "timeline2": {
            "title": "Licenciatura Engenharia Informática, Universidade de Évora",
            "date": "2022",
            "description": "Ingressei neste curso após o único ano do anterior, aproveitando as equivalências e focando-me finalmente em algo de que gosto. "
        },
        "timeline3": {
            "title": "Estágio Extracurricular, KPMG Portugal",
            "date": "2023",
            "description": "Realizei um estágio com duração de 1 ano onde realizei um projeto em OutSystems, mais precisamente uma Reactive App."
        },
        "timeline4": {
            "title": "Estágio Curricular, KMPG Portugal",
            "date": "2024",
            "description": "Passado uns meses voltei a realizar mais um estágio na empresa mas desta vez com duração de 5 meses, onde tive o objetivo de analisar e testar soluções no mercado para o papel de Analytics para Reactive Apps em OutSystems, onde pela primeira vez tive contacto com o mundo de Web Analytics."
        },
        "timeline5": {
            "title": "Conclusão da Licenciatura em Engenharia Informática",
            "date": "2021",
            "description": "Passado dois anos conclui a licenciatura."
        }
    },
    "contact": {
        "title": "Sinta-se à vontade para entrar em contacto comigo através de qualquer um dos seguintes meios.",
        "fname": "Nome",
        "femail": "Email",
        "fsubject": "Assunto",
        "fmessage": "A sua mensagem",
        "fsubmit": "Enviar"
    },
    "cookies": {
        "description": "Este site utiliza cookies para melhorar a sua experiência de utilizador. Ao usar o meu site, concorda com a utilização de cookies.",
        "learn": "Saber Mais",
        "accept": "Aceitar",
        "reject":"Rejeitar"
    }
}