{
    "header": {
        "about": "About",
        "experience": "Experience",
        "contact": "Contact",
        "abbrHome":"Home",
        "abbrLan":"Change Language",
        "abbrTheme":"Change Theme"
    },
    "footer": {
        "info1": "Designed in Figma and coded in Visual Studio Code.",
        "info2": "Built with React and CSS.",
        "terms":"Terms and Conditions"
    },
    "home": {
        "hello": "Welcome to my Website",
        "paragraph": "I'm Diogo Matos, I have a degree in Computer Science Engineering. Here you can learn more about me, such as my academic and professional trajectory. Explore my projects to see what I've worked on, discover my digital skills and discover my experience. Feel free to get in touch if you have any questions or would like to connect."
    },
    "about": {
        "about": "About",
        "paragraph": "I'm Diogo Matos. I'm 21-year-old portuguese and recently graduated with a degree in Computer Science Engineering from Évora, Portugal. Through my coursework and internships, I have developed significant programming skills. I am highly proactive and always eager to learn and work. Currently, I am focused on refining my web and mobile development abilities, particularly with the React framework, and I am actively seeking job opportunities in these areas.",
        "projects": "Projects",
        "click": "Click here to see more ↗",
        "skills": "Digital Skills"
    },
    "projects": [
        {
            "name": "Web Technologies Projects",
            "description": "One project focused primarily on front-end development, while the other was a full-stack development project.",
            "technologies": [
                "HTML",
                "CSS",
                "JavaScript",
                "Java",
                "JSP",
                "SpringBoot",
                "Rest",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/TW"
        },
        {
            "name": "Distributed Systems Projects",
            "description": "In the first project, I implemented remote method execution within the same network. The second project involved developing a REST API to manage client-server communication and data access.",
            "technologies": [
                "Java",
                "Java RMI",
                "REST",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/SDist"
        },
        {
            "name": "OutSystems Project",
            "description": "This project was completed during an extra-curricular internship at KPMG Portugal. I developed a reactive app to manage projects, their managers and resources.",
            "technologies": [
                "OutSystems", "JavaScript"
            ],
            "link": null
        }
    ],
    "dataSkills":[
        {
            "name":"HTML",
            "percentage":"90%"
        },
        {
            "name":"CSS",
            "percentage":"85%"
        },
        {
            "name":"JavaScript",
            "percentage":"85%"
        },
        {
            "name":"React.JS",
            "percentage":"70%"
        },
        {
            "name":"Java",
            "percentage":"80%"
        },
        {
            "name":"OutSystems",
            "percentage":"75%"
        },
        {
            "name":"Python",
            "percentage":"60%"
        },
        {
            "name":"C",
            "percentage":"65%"
        }
    ],
    "projectsAbbr":{
        "abbrProject":"Project Repository",
        "abbrMore": "My Repositories"
    },
    "experience": {
        "title":"Experience",
        "timeline1": {
            "title": "Bachelor's Degree in Mechatronics Engineering, University of Évora",
            "date":"2021",
            "description": "I started the course, but during the first year, I realized that my true passion was programming."
        },
        "timeline2": {
            "title": "Bachelor's Degree in Computer Science Engineering, University of Évora",
            "date":"2022",
            "description": "I enrolled in this course after my single year in the previous one, taking advantage of credit transfers and finally focusing on something that I enjoy."
        },
        "timeline3": {
            "title": "Extracurricular Internship, KPMG Portugal",
            "date":"2023",
            "description": "I completed a one-year internship where I worked on a project in OutSystems, specifically a Reactive App."
        },
        "timeline4": {
            "title": "Curricular Internship, KPMG Portugal",
            "date":"2024",
            "description": "A few months later, I undertook another internship at the company, this time lasting five months. The objective was to analyze and test market solutions for Analytics roles in Reactive Apps in OutSystems, where I had my first exposure to Web Analytics."
        },
        "timeline5": {
            "title": "Completion of Bachelor's Degree in Computer Science Engineering",
            "date":"2024",
            "description": "After two years, I completed the degree."
        }
    },
    "contact":{
        "title":"Feel free to reach out to me through any of the following channels.",
        "fname":"Name",
        "femail":"Email",
        "fsubject":"Subject",
        "fmessage":"Your message",
        "fsubmit":"Send",
        "terms_part1": "I agree to the",
        "terms_link": "Terms and Conditions",
        "terms_part3": "and acknowledge the",
        "privacy_policy_link": "Privacy Policy",
        "required": "Required",
        "invalid": "Invalid"     
    },
    "cookies":{
        "description":"This site use cookies to enhance your user experience. By using my website, you agree to my use of cookies.",
        "learn":"Learn More",
        "accept":"Accept",
        "reject":"Decline"
    },
    "policy": {
        "title": "Terms and Conditions",
        "privacyPolicy": "Privacy Policy",
        "privacyPolicyP1":"This Privacy Policy outlines the terms and conditions under which the website diogo.matos.dev@outlook.com manages the personal data of its visitors and users. As of May 25, 2018, the General Data Protection Regulation (GDPR) – Regulation No. 2016/679 of the European Parliament and of the Council of April 27, 2016 – establishes the rules regarding the protection, processing, and free movement of personal data of natural persons. This regulation applies directly to all entities processing such data in any Member State of the European Union, including Portugal.",
        "privacyPolicyP2":"The purpose of this communication is to provide you with a clear understanding of the rules applicable to the processing of your personal data, the rights you are entitled to, and how you can manage your consents directly and simply. As part of the services provided by this site, Diogo Matos, as the entity determining the means of processing and the purposes, is responsible for the processing of your personal data and for ensuring the protection of your privacy, acting in compliance with the law and the GDPR.",
        "privacyPolicyP3":"Contact: Email: diogo.matos.dev@outlook.com; Website: https://www.diogomatos.pt",
        "whyWeCollect": "Why We Collect Your Personal Data",
        "whyWeCollectP1":"The website diogomatos.pt collects personal data to communicate with you about potential collaborations, provide you with updates on new projects, and fulfill any legal obligations. The data collected is processed with a commitment to privacy and security. Your data is obtained through information provided directly or indirectly by you via forms, emails, or interactions on the website.",
        "whyWeCollectP2":"You have the right at any time to access your personal data, as well as to modify, restrict, or delete it within the limits of the GDPR. You may withdraw your consent or exercise other rights provided by law by sending an email to diogo.matos.dev@outlook.com",
        "dataSharing": "Will Your Personal Data Be Shared with Third Parties?",
        "dataSharingP1":"To fulfill the purposes stated in this Privacy Policy, it may be necessary to share your personal data with third parties who support us in the services provided, such as hosting providers or web development tools.",
        "dataRetention": "Retention of Personal Data",
        "dataRetentionP1":"The website diogomatos.pt will retain your personal data for as long as necessary to provide the services and to comply with legal obligations.",
        "consentWithdrawal": "Consequences of Withdrawing Consent",
        "consentWithdrawalP1":"If you withdraw your consent, it does not compromise the legality of the processing carried out up to that date. The existing data will be destroyed.",
        "dataPortability": "Right to Data Portability",
        "dataPortabilityP1":"If you have given your consent or we are executing a contract, you have the right to request data portability. This means you have the right to receive the data you provided in a structured, commonly used, and machine-readable format and transmit it directly to another entity without hindrance from us.",
        "useOfData": "Use of Personal Data",
        "useOfDataP1":"When you provide us with information such as your name, email address, or other contact details for the purposes of collaboration or discussing projects, this data will be subject to this Privacy Policy, the Terms of Use, and other referenced documents (see “Terms of Use”), applicable at any time and which should be reviewed to ensure they are accepted.",
        "changesPolicy": "Changes to the Privacy Policy",
        "changesPolicyP1":"The website diogomatos.pt reserves the right to make changes to its Privacy Policy at any time without prior notice. In such cases, you will be notified of any changes that may affect your privacy.",
        "cookieInformation": "Cookie Information",
        "cookieInformationP1":"The website diogomatos.pt uses cookies, both first-party and third-party, and similar devices to enhance the user experience, understand how users interact with the site, and, in certain cases, present relevant advertisements based on browsing habits.",
        "whatAreCookies": "What are Cookies?",
        "whatAreCookiesP1":"Cookies are small text files stored on the user's device via the internet browser. These files only contain information related to user preferences and do not include personal data.",
        "whatAreCookiesP2":"The cookies used by diogomatos.pt adhere to principles of anonymity and confidentiality, and are used solely to recognize the user during future visits to the site. They are not used to collect personally identifiable information nor for direct marketing purposes.",
        "cookiesUse": "What are Cookies Used For?",
        "cookiesUseP1":"Cookies help improve the usability of the website, allowing faster and more efficient navigation, and eliminating the need to repeatedly enter the same information. They also serve to analyze browsing patterns and optimize the site structure.",
        "cookiesTypes": "What Types of Cookies Are Used on Our Website?",
        "cookiesTypesP1":"The cookies used on diogomatos.pt have different functions and are categorized as follows:",
        "cookiesTypesP2":"Strictly Necessary Cookies: These are essential for navigating the website and using its features, such as accessing secure areas. Without these cookies, the services you requested cannot be provided.",
        "cookiesTypesP3":"Analytical Cookies: These cookies are used to collect information about how visitors use the site, such as which pages are most visited or if error messages are encountered on certain pages. These cookies are used for statistical purposes and to improve the website continuously.",
        "cookiesTypesP4":"Functionality Cookies: These cookies store user preferences regarding the use of the site, such as language or preferred region, to offer a more personalized experience.",
        "manageCookies": "How to Manage Cookies?",
        "manageCookiesP1":"You can configure your internet browser settings at any time to be notified about the reception of cookies and decide whether to accept, reject, or delete them. Please note that refusing to use cookies may result in some website features being unavailable or navigation not being optimized.",
        "termsOfUse": "Terms of Use",
        "termsOfUseP1":"The information available on diogomatos.pt can be viewed, copied, printed, and distributed exclusively for non-commercial use, provided that all copies include the legal copyright notice below. This information may also be used to request collaboration or project information. The content of this site may not be modified or reinterpreted to be protected under another copyright, patent, trademark, or intellectual property registration that does not belong to Diogo Matos.",
        "termsOfUseP2":"The information available on diogomatos.pt may contain technical inaccuracies or typographical errors. Consequently, Diogo Matos assumes no responsibility for direct, indirect, incidental, or collateral damages resulting from visiting these pages, including data loss, loss of revenue or other profits, and business process interruption resulting from the use or inability to use the information on this site.",
        "termsOfUseP3":"Diogo Matos also declines any responsibility for the content of third-party websites that link to or from diogomatos.pt.",
        "copyright": "Copyright",
        "copyrightP1":"All elements contained on the website diogomatos.pt, including texts, photos, illustrations, and others, are protected by law under the Copyright and Related Rights Code.",
        "copyrightP2":"The copying, reproduction, and dissemination of texts, photos, illustrations, and other elements contained on this website are expressly prohibited without the express authorization of Diogo Matos, regardless of the means used, except for the legal citation right.",
        "copyrightP3":"Commercial use of the elements contained on the website diogomatos.pt, including texts, photos, illustrations, and others, is expressly prohibited.",
        "copyrightP4":"Diogo Matos reserves the right to take legal action against the authors of any unauthorized copying, reproduction, dissemination, or commercial exploitation of the elements contained on this website, including texts, photos, illustrations, and others."
    }
}