{
    "header": {
        "about": "About",
        "experience": "Experience",
        "contact": "Contact"
    },
    "footer": {
        "info": "Designed in Figma and coded in Visual Studio Code. Built with React and CSS."
    },
    "home": {
        "hello": "Welcome to my Website",
        "paragraph": "I'm Diogo Matos, I have a degree in Computer Engineering. Here you can learn more about me, such as my academic and professional trajectory. Explore my projects to see what I've worked on, discover my digital skills and discover my experience. Feel free to get in touch if you have any questions or would like to connect."
    },
    "about":{
        "about":"About",
        "paragraph":"I'm Diogo Matos. I'm 21-year-old portuguese and recently graduated with a degree in Computer Science Engineering from Évora, Portugal. Through my coursework and internships, I have developed significant programming skills. I am highly proactive and always eager to learn and work. Currently, I am focused on refining my web and mobile development abilities, particularly with the React framework, and I am actively seeking job opportunities in these areas.",
        "projects":"Projects",
        "click":"Click here to see more ↗",
        "skills":"Digital Skills"
    },
    "projects": [
        {
            "name": "Web Technologies Projects",
            "description": "One project focused primarily on front-end development, while the other was a full-stack development project.",
            "technologies": [
                "HTML",
                "CSS",
                "JavaScript",
                "Java",
                "JSP",
                "SpringBoot",
                "Rest",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/TW"
        },
        {
            "name": "Distributed Systems Projects",
            "description": "In the first project, I implemented remote method execution within the same network. The second project involved developing a REST API to manage client-server communication and data access.",
            "technologies": [
                "Java",
                "Java RMI",
                "REST",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/SDist"
        },
        {
            "name": "OutSystems Project",
            "description": "This project was completed during an extra-curricular internship at KPMG Portugal. I developed a reactive app to manage projects, their managers and resources.",
            "technologies": [
                "OuSystems"
            ],
            "link": null
        }
    ]
}