{
    "header": {
        "about": "About",
        "experience": "Experience",
        "contact": "Contact",
        "abbrHome":"Home",
        "abbrLan":"Change Language",
        "abbrTheme":"Change Theme"
    },
    "footer": {
        "info1": "Designed in Figma and coded in Visual Studio Code.",
        "info2": "Built with React and CSS.",
        "terms":"Terms and Conditions"
    },
    "home": {
        "hello": "Welcome to my Website",
        "paragraph": "I'm Diogo Matos, I have a degree in Computer Engineering. Here you can learn more about me, such as my academic and professional trajectory. Explore my projects to see what I've worked on, discover my digital skills and discover my experience. Feel free to get in touch if you have any questions or would like to connect."
    },
    "about": {
        "about": "About",
        "paragraph": "I'm Diogo Matos. I'm 21-year-old portuguese and recently graduated with a degree in Computer Science Engineering from Évora, Portugal. Through my coursework and internships, I have developed significant programming skills. I am highly proactive and always eager to learn and work. Currently, I am focused on refining my web and mobile development abilities, particularly with the React framework, and I am actively seeking job opportunities in these areas.",
        "projects": "Projects",
        "click": "Click here to see more ↗",
        "skills": "Digital Skills"
    },
    "projects": [
        {
            "name": "Web Technologies Projects",
            "description": "One project focused primarily on front-end development, while the other was a full-stack development project.",
            "technologies": [
                "HTML",
                "CSS",
                "JavaScript",
                "Java",
                "JSP",
                "SpringBoot",
                "Rest",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/TW"
        },
        {
            "name": "Distributed Systems Projects",
            "description": "In the first project, I implemented remote method execution within the same network. The second project involved developing a REST API to manage client-server communication and data access.",
            "technologies": [
                "Java",
                "Java RMI",
                "REST",
                "JDBC",
                "PostgreSQL"
            ],
            "link": "https://github.com/DiogoMatos10/Uni/tree/main/SDist"
        },
        {
            "name": "OutSystems Project",
            "description": "This project was completed during an extra-curricular internship at KPMG Portugal. I developed a reactive app to manage projects, their managers and resources.",
            "technologies": [
                "OuSystems"
            ],
            "link": null
        }
    ],
    "projectsAbbr":{
        "abbrProject":"Project Repository",
        "abbrMore": "My Repositories"
    },
    "experience": {
        "title":"Experience",
        "timeline1": {
            "title": "Bachelor's Degree in Mechatronics Engineering, University of Évora",
            "date":"2021",
            "description": "I started the course, but during the first year, I realized that my true passion was programming."
        },
        "timeline2": {
            "title": "Bachelor's Degree in Computer Engineering, University of Évora",
            "date":"2022",
            "description": "I enrolled in this course after my single year in the previous one, taking advantage of credit transfers and finally focusing on something that I enjoy."
        },
        "timeline3": {
            "title": "Extracurricular Internship, KPMG Portugal",
            "date":"2023",
            "description": "I completed a one-year internship where I worked on a project in OutSystems, specifically a Reactive App."
        },
        "timeline4": {
            "title": "Curricular Internship, KPMG Portugal",
            "date":"2024",
            "description": "A few months later, I undertook another internship at the company, this time lasting five months. The objective was to analyze and test market solutions for Analytics roles in Reactive Apps in OutSystems, where I had my first exposure to Web Analytics."
        },
        "timeline5": {
            "title": "Completion of Bachelor's Degree in Computer Engineering",
            "date":"2024",
            "description": "After two years, I completed the degree."
        }
    },
    "contact":{
        "title":"Feel free to reach out to me through any of the following channels.",
        "fname":"Name",
        "femail":"Email",
        "fsubject":"Subject",
        "fmessage":"Your message",
        "fsubmit":"Send"
    },
    "cookies":{
        "description":"This site use cookies to enhance your user experience. By using my website, you agree to my use of cookies.",
        "learn":"Learn More",
        "accept":"Accept",
        "reject":"Decline"
    }
}